from flask import Flask, url_for, request, redirect, render_template
from flask_wtf import FlaskForm
from wtforms import SubmitField
from wtforms.validators import DataRequired

app = Flask(__name__)

regoins = [
    "Ярославская область", "Ямало-Ненецкий АО", "Чукотский АО", "Чувашская Республика",
    "Чеченская Республика", "Челябинская область", "Ханты-Мансийский Автономный округ", "Республика Хакасия",
    "Хабаровский край", "Ульяновская область", "Удмуртская Республика", "Тюменская область", "Республика Тыва",
    "Тульская область", "Томская область", "Тверская область", "Республика Татарстан", "Тамбовская область",
    "Ставропольский край", "Смоленская область", "Республика Северная Осетия - Алания", "Свердловская область",
    "Сахалинская область", "Республика Сахалин (Якутия)", "Саратовская область", "Самарская область",
    "Рязанская область", "Ростовская область", "Псковская область", "Приморский край", "Пермский край",
    "Пензенская область", "Орловская область", "Оренбургская область", "Омская область", "Новосибирская область",
    "Новгородская область", "Нижегородская область", "Ненецкий АО", "Мурманская область", "Москва и пригород",
    "Московская область", "Республика Мордовия", "Республика Марий Эл", "Магаданская область", "Липецкая область",
    "Санкт-Петербург и пригород", "Ленинградская область", "Курская область", "Курганская область",
    "Красноярский край", "Краснодарский край", "Костромская область", "Республика Коми", "Кировская область",
    "Кемеровская область", "Республика Карелия", "Карачаево-Черкесская Республика", "Камчатский край",
    "Калужская область", "Республика Калмыкия", "Калининградская область", "Кабардино-Балкарская Республика",
    "Иркутская область", "Республика Ингушетия", "Ивановская область", "Забайкальский край", "Еврейская АО",
    "Республика Дагестан", "Воронежская область", "Вологодская область", "Волгоградская область",
    "Владимирская область", "Республика Бурятия", "Брянская область", "Белгородская область",
    "Республика Башкортостан", "Астраханская область", "Архангельская область", "Амурская область",
    "Алтайский край", "Республика Алтай", "Республика Адыгея"
]


class MainPage(FlaskForm):
    submit = SubmitField('regions')


@app.route('/', methods=['GET', 'POST'])
def main():
    print(request.data)
    if request.method == 'POST':
        if request.form['region'] == 'Do Something':
            return redirect('/regions/123')
    if request.method == 'GET':
        return f"""
        <link rel="stylesheet" href="{url_for('static', filename='css/style.css')}"><div class="wrap">
        <button class="button" name="region" value="Do Something">Submit</button></div>"""
    # href="{url_for('static', filename='css/style.css')}">


@app.route('/regions/<reg_name>')
def roots(reg_name):
    print(reg_name)
    return f'{regoins[regoins.index(reg_name)]}'


if __name__ == '__main__':
    app.run(port=8080, host='127.0.0.1')
